app/views/pages/family.html.erb

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."apartment_id" = $1  [["apartment_id", 1]]
---
					<tbody>
						<% current_user.apartment.users.all.each do |person| %>

SELECT "children".* FROM "children" WHERE "children"."apartment_id" = $1  [["apartment_id", 1]]
---
			  <tbody>
			    <% current_user.apartment.children.all.each do |child| %>

SELECT "pets".* FROM "pets" WHERE "pets"."apartment_id" = $1  [["apartment_id", 1]]
---
				  	<tbody>
				    <% current_user.apartment.pets.each do |pet| %>

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."apartment_id" = $1  [["apartment_id", 1]]
---
						<tbody>
					    <% current_user.apartment.vehicles.each do |vehicle| %>

SELECT "werehouses".* FROM "werehouses" WHERE "werehouses"."apartment_id" = $1  [["apartment_id", 1]]
---
				<tbody>
			    <% current_user.apartment.werehouses.each do |werehouse|%>