app/controllers/advertisements_controller.rb

SELECT "advertisements".* FROM "advertisements"
---
  def index
    @advertisements = Advertisement.all