app/controllers/common_areas_controller.rb

SELECT "common_areas".* FROM "common_areas"
---
  def index
    $common_areas = CommonArea.all