app/controllers/decisions_controller.rb

  def index
    @decisions = Decision.all
---
SELECT "decisions".* FROM "decisions"