app/views/users/registrations/new.html.erb

      <%= f.label :hobbies, t('Intereses')%><br />
      <%= f.collection_check_boxes :hobbies, Hobby.all, :name, :name do |b|%>
---
SELECT "hobbies".* FROM "hobbies"

      <%= f.label :apartment_id, t('Apartamento')%><br />
      <%= f.collection_select :apartment_id, Apartment.all, :id, :apto, prompt: "Escoge apartamento" %>
---
SELECT "apartments".* FROM "apartments"